Repository: glehmann/uptodate
Catalog: locale/*/LC_MESSAGES/uptodate.po
Languages: fr

source: and
fr: et

source: %(d)i/%(M)i/%(y)i %(h)i:%(m)i
fr: %(d)i/%(M)i/%(y)i %(h)ih%(m)i

source: %(module)s comment: %(comment)s history: %(history)s current versions: %(current)s URL: %(url)s regular expression: %(regexp)s
fr: %(module)s commentaire : %(comment)s historique : %(history)s versions actuelles: %(current)s URL : %(url)s expression regulière: %(regexp)s

source: %s value:
fr: %s valeur :

source: %s: %s added.
fr: %s : %s ajoutée.

source: %s: %s removed.
fr: %s : %s supprimée.

source: %s: Searching new versions.
fr: %s : Recherche de nouvelles versions.

source: Add a new module
fr: Ajoute un nouveau module

source: Add a new module with no need of a regular expression
fr: Ajoute un nouveau module sans avoir à donner une expression régulière

source: Add is used to add a new module. A module has a name and contains the appropriate informations in order to search the new versions: - the module's name - the URL of a file or a directory. The file or the directory may be distant (website, ftp) or local. - a regular expression which find the versions in the received data from the URL. You can add a comment to describe the module, to store the homepage, etc. Example: uptodate add zope http://www.zope.org/Products/ 'Download Zope (.{1,10})\s*</a>' -C 'A leading open source application server'
fr: Add est utilisé pour ajouter un nouveau module. Un module a un nom et contient les informations nécessaires pour la recherche de nouvelles versions: - le nom du module - l'URL d'un fichier ou d'un répertoire. Le fichier ou le répertoire peut être distant (site web, site ftp) ou local. - une expression régulière utilisée pour trouver les nouvelles versions dans les donnée obtenues depuis l'URL. Vous pouvez ajouter un commentaire pour décrire le module, retenir le site web, etc. Exemple : uptodate add zope http://www.zope.org/Products/ 'Download Zope (.{1,10})\s*</a>' -C 'Un excellent serveur d'application open source'

source: Auto is used in order to add a new module with no need of the regular expression used to get versions. You must give: + the module's name. If the name is in the received data from the URL, it'll influence the choice of the regular expression. + the URL of a file or a directory. The file or the directory may be distant (website, ftp) or local. + an existing version number. This version number allows to find the regular expression which will be used to obtain new versions. You can add a comment to describe the module, to store the homepage, etc. Examples: + zope uptodate auto zope http://www.zope.org/Products/ 2.7.4 + InsightToolkit, from the sourceforge download page: uptodate auto InsightToolkit 'http://sourceforge.net/project/showfiles.php?group_id=108122&package_id=116777' 2.0.1 + jpackage non free files, from a ftp directory : uptodate auto jpackage ftp://sunsite.informatik.rwth-aachen.de/pub/Linux/jpackage/1.6/generic/SRPMS.non-free/ j2ee-connector-1.5-3jpp.nosrc.rpm + jpackage releases, from a ftp directory : uptodate auto jpackage-release ftp://sunsite.informatik.rwth-aachen.de/pub/Linux/jpackage/ 1.6
fr: Auto est utilisé pour ajouter un nouveau module sans avoir a fournir l'expression régulière qui permet d'obtenir les versions.Vous devez fournir :- le nom du module - l'URL d'un fichier ou d'un répertoire. Le fichier ou le répertoire peut être distant (site web, site ftp) ou local. - une expression régulière utilisée pour trouver les nouvelles versions dans les donnée obtenues depuis l'URL. - un numéro de version présent à l'URL fournie. Ce numéro permet de trouver l'expression régulière qui sera utilisée pour obtenir les nouvelles versions. Vous pouvez ajouter un commentaire pour décrire le module, pour retenir le site web, etc. Examples: + zope uptodate auto zope http://www.zope.org/Products/ 2.7.4 + InsightToolkit, from the sourceforge download page: uptodate auto InsightToolkit 'http://sourceforge.net/project/showfiles.php?group_id=108122&package_id=116777' 2.0.1 + jpackage non free files, from a ftp directory : uptodate auto jpackage ftp://sunsite.informatik.rwth-aachen.de/pub/Linux/jpackage/1.6/generic/SRPMS.non-free/ j2ee-connector-1.5-3jpp.nosrc.rpm + jpackage releases, from a ftp directory : uptodate auto jpackage-release ftp://sunsite.informatik.rwth-aachen.de/pub/Linux/jpackage/ 1.6

source: Available regular expressions:
fr: Expressions régulières disponibles :

source: Choose a regular expression (0):
fr: Choisissez une expression régulière (0) :

source: Copy a module
fr: Copie un module

source: Copy is used in order to copy a module. Example: uptodate copy itk-app InsightToolkit-Applications
fr: Copy est utilisé pour copier un module. Exemple :uptodate copy itk-app InsightToolkit-Applications

source: Display informations about modules
fr: Affiche les informations de modules

source: Display is used in order to display informations about modules. Example: uptodate display itk-app
fr: Display est utilisé pour afficher les informations sur les modules. Exemple : uptodate display itk-app

source: Display versions history
fr: Affiche l'historique des versions

source: Do you want to remove the module %s?
fr: Voulez-vous supprimer le module %s ?

source: Edit is used in order to modify module's properties. Modifiable properties are: added, removed, current, add-command, remove-command, url, regexp and comment. If url or regexp are modified, uptodate check if it can obtain versions before validating changes. Example: uptodate edit itk-app comment 'applications using InsightToolkit'
fr: Edit est utiliser pour modifier une propriété d'un module. Les propriétés modifiable sont : added, removed, current, add-command, remove-command, url, regexp et comment. SI url ou regexp sont modifiés, uptodate vérifie si il peut obtenir des versions avant de valider les modifications. Exemple: uptodate edit itk-app comment 'applications utilisant itk'

source: Error: Invalid data.
fr: Erreur : Données invalides.

source: Error: No version found.
fr: Erreur : Aucune version trouvée.

source: Error: Property %s doesn't exist.
fr: Erreur : La propriété %s n'éxiste pas.

source: Error: The command %s doesn't exist.
fr: Erreur : La commande %s n'existe pas.

source: Error: The module %s already exists.
fr: Erreur : Le module %s existe déjà.

source: Error: The module %s doesn't exist.
fr: Erreur : Le module %s n'existe pas.

source: Error: The modules %s don't exist.
fr: Erreur : Les modules %s n'existent pas.

source: Export is used in order to export modules. Examples: uptodate -o config export -a uptodate export itk-app > config
fr: Export est utilisé pour exporter des modules. Exemples : uptodate -o config export -a uptodate export itk-app > config

source: Export modules
fr: Exporte des modules

source: FILE
fr: FICHIER

source: History is used in order to display versions history. Examples: uptodate history itk-app uptodate history --all --last 10
fr: History est utilisé pour afficher l'historique des versions. Exemples : uptodate history itk-app uptodate history --all --last 10

source: IO error
fr: Erreur d'entée/sortie

source: Import is used in order to import modules. Example: uptodate import config
fr: Import est utilisé pour importer des modules. Exemple : uptodate import config

source: Import modules
fr: Importe des modules

source: Invalid arguments number
fr: Nombre d'arguments invalide

source: Invalid data
fr: Donnée invalide

source: Keyboard interrupt
fr: Iterruption au clavier

source: Modify module's properties
fr: Modifie les propriétés d'un module

source: Module not found
fr: Module non trouvé

source: No version found
fr: Aucune version trouvé

source: Property not found
fr: Propritété non trouvé

source: Remove is used in order to remove modules. Example: uptodate remove itk-app
fr: Remove est utilisé pour supprimer des modules. Exemples : uptodate remove itk-app

source: Remove modules
fr: Supprime des modules

source: Rename a module
fr: Renomme un module

source: Rename is used in order to rename a module Example: uptodate rename itk-app InsightToolkit-Applications
fr: Rename est utilisé pour renommer un module. Exemple : uptodate rename itk-app InsightToolkit-Applications

source: Search is used in order to find new versions of the wanted modules. By default, new and removed versions are displayed. The found versions are stored in order to display the modification at the next search. You can execute this command periodically (with cron for example) to follow the versions evolution. Example: uptodate check zope zope: '2.7.5' added. zope: '2.7.4' removed.
fr: Check est utilisé pour chercher les nouvelles versions des modules donnés en paramètres. Par défaut, les nouvelles versions et les versions supprimées sont affichées. Les versions trouvées sont enregistrées afin de pouvoir afficher les modifications à la prochaine recherche. Vous pouvez exécuter cette commande périodiquement (avec cron par exemple) pour suivre l'évolution des versions. Exemple : uptodate check zope zope : '2.7.5' ajouté. zope : '2.7.4' supprimé.

source: Search new versions
fr: Recherche les nouvelles versions

source: This module already exists
fr: Ce module existe déjà

source: Unknown command
fr: Commande inconnue

source: Warning: No version fond for %s. The current versions are kept.
fr: Attention : Aucune version trouvé pour le module %s. Les versions actuelles sont conservées.

source: Y/n
fr: O/n

source: allows to choose a regular expression in the list proposed by uptodate
fr: permet de choisir une expression régulière dans la liste proposée par uptodate

source: associate the comment with the module
fr: associe le commentaire au module

source: display added versions history
fr: affiche l'historique des versions ajoutées

source: display all modules
fr: affiche tous les modules

source: display available options and commands
fr: affiche les options et les commandes disponibles

source: display history of all modules
fr: affiche l'historique de tous les modules

source: display last X modifications
fr: affiche les X dernières modifications

source: display removed versions history
fr: affiche les version supprimées

source: display the added versions since last search
fr: affiche les versions ajoutées depuis la dernière recherche

source: display the removed versions since last search
fr: affiche les versions supprimées depuis la dernière recherche

source: don't ask question
fr: ne pas poser de question

source: don't save the changes
fr: ne pas sauver les changements

source: execute this command when a new version is available
fr: exécute cette commande quand une nouvelle version est disponible

source: execute this command when a version is no more available
fr: exécute cette commande quand une version n'est plus disponible

source: ignore the missing modules
fr: ignorer les modules absents

source: import all modules in file
fr: importe tous les modules du fichier

source: no
fr: non

source: none
fr: aucun

source: remove all modules
fr: supprime tous les modules

source: search the new versions of all modules
fr: cherche les nouvelles versions de tous les modules

source: uptodate [options] add name url regexp
fr: uptodate [options] add nom url regexp

source: uptodate [options] auto name url version
fr: uptodate [options] auto nom url version

source: uptodate [options] command [arguments]
fr: uptodate [options] commande [arguments]

source: uptodate [options] copy name name
fr: uptodate [options] copy nom nom

source: uptodate [options] display [name] ...
fr: uptodate [options] display [nom] ...

source: uptodate [options] edit name property [value]
fr: uptodate [options] edit nom propriété [valeur]

source: uptodate [options] export [name] ...
fr: uptodate [options] export [nom] ...

source: uptodate [options] history [name] ...
fr: uptodate [options] history [nom] ...

source: uptodate [options] import file [name] ...
fr: uptodate [options] import fichier [nom] ...

source: uptodate [options] remove [name] ...
fr: uptodate [options] remove [nom] ...

source: uptodate [options] rename name name
fr: uptodate [options] rename nom nom

source: uptodate [options] search [name] ...
fr: uptodate [options] search [nom] ...

source: uptodate allows you to trace the versions of everything which has a version uptodate is powerful and user friendly command line tool which helps you to know when a new version is available. It searches for new versions in a web page, a ftp directory, etc, and shows you added and removed version since the last search. If you update some softs by hand, if you are a package maintainer, or if you simply want to know when the new version of your favorite game (or everything else with a version) is out, uptodate is for you ! Author: Gaetan Lehmann <gaetan.lehmann@jouy.inra.fr> Website: http://gleh.dyndns.org/uptodate/ Commands: %s Run "uptodate command --help" for more detailed help. Exit codes: %s
fr: uptodate permet de suivre les versions de tout ce qui a une version uptodate est un programme en ligne de commande facile à utiliser qui vous aide à savoir quand une nouvelle version est disponible. Il recherche les versions dans une page web, un répertoire ftp, etc, et vous montre les versions ajoutées et supprimées depuis la dernière recherche. Si vous mettez à jour certains logiciels à la main, si vous êtes mainteneur de paquetages (rpm, deb, ...), ou si vous voulez simplement savoir quand la nouvelle version de votre jeu favori (ou de tout autre chose avec une version) est disponible, uptodate est fait pour vous ! Auteur : Gaëtan Lehmann <gaetan.lehmann@jouy.inra.fr> Site web : http://gleh.dyndns.org/uptodate/ Commandes : %s Exécuter "uptodate commande --help" pour plus d'information. Codes de sortie : %s

source: use FILE as config file (default: %default)
fr: utilise le fichier de configuration FICHIER (%default par défaut)

source: verbose mode
fr: mode volubile

source: write in a file (default: standard output)
fr: écrit les sorties dans le fichier FICHIER (sortie standard par défaut)

source: y
fr: o

source: y/N
fr: o/N

source: y/n
fr: o/n

source: yes
fr: oui
